run/tutorials/heatTransfer/buoyantBoussinesqSuperFluidPimpleFoam/GoerterMellinkDuct1D/0/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1606+                                |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    UP
    {
        type            fixedValue;
		value			uniform 0;
    }
    DOWN
    {
        type            fixedFluxPressure;
        rho             rhok;
        value           uniform 0;
    }
    SYM
    {
        type            empty;
    }
    ADIABATIC
    {
        type            empty;
    }
}

// ************************************************************************* //
